{"class_name": "Functional", "config": {"name": "model_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 38], "dtype": "float32", "sparse": false, "ragged": false, "name": "left_input"}, "name": "left_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 38], "dtype": "float32", "sparse": false, "ragged": false, "name": "right_input"}, "name": "right_input", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "DeepNN", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 38], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "h1", "trainable": true, "dtype": "float32", "units": 30, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "h1", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "h2", "trainable": true, "dtype": "float32", "units": 25, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "h2", "inbound_nodes": [[["h1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 13, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["h2", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]]}, "name": "DeepNN", "inbound_nodes": [[["left_input", 0, 0, {}]], [["right_input", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "output_layer", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAAHAAAAQwAAAHM4AAAAfABcAn0BfQJ0AGoBdACgAnwBfAIYAKEBZAFk\nAmQDjQN9A3QAoAN0AKAEfAN0AKAFoQChAqEBUwApBE7pAQAAAFQpAtoEYXhpc9oIa2VlcGRpbXMp\nBtoBS9oDc3Vt2gZzcXVhcmXaBHNxcnTaB21heGltdW3aB2Vwc2lsb24pBNoFdmVjdHPaAXjaAXna\nCnN1bV9zcXVhcmWpAHIOAAAA+h48aXB5dGhvbi1pbnB1dC01LTYzMzI3MTk5NTY3Mj7aEmV1Y2xp\nZGVhbl9kaXN0YW5jZWsAAABzBgAAAAgBGgEWAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": ["4wEAAAAAAAAAAAAAAAMAAAACAAAAQwAAAHMUAAAAfABcAn0BfQJ8AWQBGQBkAmYCUwApA07pAAAA\nAOkBAAAAqQApA9oGc2hhcGVz2gZzaGFwZTHaBnNoYXBlMnIDAAAAcgMAAAD6HjxpcHl0aG9uLWlu\ncHV0LTUtNjMzMjcxOTk1NjcyPtoWZXVjbF9kaXN0X291dHB1dF9zaGFwZXEAAABzBAAAAAgBDAE=\n", null, null], "output_shape_type": "lambda", "output_shape_module": "__main__", "arguments": {}}, "name": "output_layer", "inbound_nodes": [[["DeepNN", 1, 0, {}], ["DeepNN", 2, 0, {}]]]}], "input_layers": [["left_input", 0, 0], ["right_input", 0, 0]], "output_layers": [["output_layer", 0, 0]]}, "keras_version": "2.11.0", "backend": "tensorflow"}